trade_exp/src/Catalogs/Претензии/Претензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Претензии</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВиновныйСотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВиновноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОписаниеПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаВозникновения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РезультатыОтработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>МенеджерПоставок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОснованиеЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9cae79c-a16b-40d9-8488-03d26096d8e3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc67b352-c0f9-4ea4-aa3b-d5b88a11aedf">
    <name>ИДБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="84fcecf8-663e-4d3d-ab50-6b8838f0ebed">
    <name>ПредоставлениеФотоВидео</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fc62e94d-5667-43bb-b726-6886ce3e6ffd">
    <name>ДатаПредоставления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4d077e7b-7ba7-4dee-b907-39b3e8dbf89c">
    <name>ИсточникПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c99bcc81-7489-411c-8dcb-c8926c6b23c4">
    <name>НомерИсходящегоПисьмаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c36a5a8a-cd17-4c15-ade1-6de876c81534">
    <name>СуммаУдовлетворения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d07ae2c1-2c31-4135-9010-220439eb95b1">
    <name>СтатусПретензииПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="339626c5-c53c-4925-95fb-fb5c4cde6945">
    <name>ЭтоПретензияПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="741f1a90-1b36-4eb7-b101-3d87617e7979">
    <name>ВестиРасчетыПоПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="183f5f2c-d3fb-4930-a647-272852e2a96c">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f64c00cc-654d-4d80-a116-4fc31bb1ff3d">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ba1b449-0126-4391-9be0-311b38f07b38">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99e3ab5c-1219-4baf-966f-b057f51d380e">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="05fd5b83-2b3a-457a-88a8-178c7c1c7e57">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8d6fbe9-5246-4731-bf64-1f9886b04b35">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01617f9e-3e2c-46c1-8e50-8a851d168fce">
    <name>ДатаОтветаПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f82078ee-7857-4352-8194-eb0fcffb3186">
    <name>РезультатПоПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c14348e-0b03-469a-bbdc-58a117de5e66">
    <name>ЕстьПисьменнаяПретензия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02926def-a90f-4f64-9dd3-f193937d3316">
    <name>ДатаПисьменнойПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7fc051e-b717-45c4-b0d0-7579bb1d0375">
    <name>СуммаПретензии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5b0375fa-7fe1-4029-91fb-1919523bc9ca">
    <name>МестонахождениеТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b44581f6-a7e7-4f6a-bef1-347e03c7283b">
    <name>НомерЗадачиВБитриксе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>РольПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Оборот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e6ca0a5a-24fa-4157-b555-58ff1aa5235c">
      <name>КоличествоБрак</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/AccumulationRegisters/ЗаказыКДоставке/ЗаказыКДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="81e2ad59-db2f-44b0-bd59-b41113531600">
  <name>ЗаказыКДоставке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="b3b4dcbf-350b-46ea-a45e-8818c5c59d21">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="07059008-fa97-415d-a41f-dc26d7572867">
    <name>Рейс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="6e8dc3ce-4050-42cf-b74c-de0160eabf02">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1b3cd544-3144-477d-80f7-3e6b656db96c">
    <name>ДокументПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СебестоимостьТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <attributes extendedConfigurationObject="3d7f4871-4ad5-47c1-ae72-77ffba33a92e">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="935bd59c-89ae-4e2b-990a-97233617ce3d">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f8e7972-07b8-4c04-97a1-a6fcfdcd4b2c">
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ffeff26a-c1d5-4cb3-a410-81eb32db8022">
    <name>СтатьяРасходовСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e51bd0ad-2d52-4827-b5bb-83d36a080227">
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dbe323e6-5da5-4078-bbcc-48cf76333c4b">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f6a0080e-a2e3-4ed1-a4d2-42d9b01b3fbe">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="54deafa3-3c0c-49db-874d-0ed14fdd4781">
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3940101b-5682-4dc0-af5e-686005c0a991">
    <name>АналитикаУчетаПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/СобытияОбъектовАльтерра/СобытияОбъектовАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e70f20ec-7ffe-4467-9958-8ee45b3ba97e">
  <name>СобытияОбъектовАльтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions extendedConfigurationObject="9d6673f6-d579-46b5-8c82-6134e22aff40">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bf1bcf04-f54e-4486-b6f2-435be7f36471">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d7cfc87f-ac09-44aa-91d9-6511c408c5cb">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cc8e3172-491d-45d8-a7eb-fc6c400845cb">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae6d0e12-8857-476c-b4b2-f03295cbed3e">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d6969c1e-e13c-4542-abb7-9cf6bb50b8e2">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bbbfb817-8db3-4415-86c3-af028276d6e9">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa7d5ca4-3c02-4ca1-a790-2435ee9f9f02">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Претензии/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы_Справочники    

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	НовыйРеквизит = Элементы.Добавить("СтатусПретензииПоставщику", Тип("ПолеФормы"), Элементы.ГруппаТипСтатус); 
	НовыйРеквизит.Заголовок = "Статус"; 
	НовыйРеквизит.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйРеквизит.ПутьКДанным = "Объект.СтатусПретензииПоставщику";   
	НовыйРеквизит.УстановитьДействие("ПриИзменении", "СтатусПретензииПоставщикуПриИзмененииПосле");	
КонецПроцедуры

&НаКлиенте
Процедура Спр_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Доработки для претензий поставщику
	Если Объект.ЭтоПретензияПоставщику Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ИДБизнесПроцесса) Тогда
	
	Режим = РежимДиалогаВопрос.ДаНет;
      

    Ответ = Вопрос("Создать бизнес-процесс?", Режим,0) ;
      
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		КодЭлементаСписка = Спр_СоздатьБППослеНаСервере();
		Если Не ПустаяСтрока(КодЭлементаСписка) Тогда
			Объект.ИДБизнесПроцесса = КодЭлементаСписка;
			Сообщить("БП создан!");
			ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
			
			ЭтаФорма.элементы.ФормаСоздатьБП.Доступность=Ложь;
		Иначе
			Объект.ИДБизнесПроцесса = "";
			Сообщить("БП не создан!");
		КонецЕсли;
		
	КонецЕсли ;
	
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Спр_ПриОткрытииПосле(Отказ) 
	
	
	Основание = "";
	
	Если ЗначениеЗаполнено(Объект.ОснованиеЧекККМ) Тогда
		Основание =  Объект.ОснованиеЧекККМ;
	ИначеЕсли ЗначениеЗаполнено(Объект.Основание) Тогда
		Основание = Объект.Основание;
	КонецЕсли;
	
	Подразделение = ПолучитьПодразделениеОснование(Основание);

	Если ЗначениеЗаполнено(Основание) Тогда
		ДокументПродажи = ПолучитьДокументПродажи(Основание);
		ЗаданиеНаПеревозкуРейс = ПолучитьРейс(ДокументПродажи,Истина);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.ИДБизнесПроцесса) Тогда
		ЭтаФорма.элементы.ФормаСоздатьБП.Доступность=Ложь;
	КонецЕсли;
	
	Если Не ДоступныПолныеПрава() Тогда
		ЭтаФорма.Элементы.ОчиститьИДБП.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьЗначенияСпискаВыбора();
	
	ИзменитьФормуПоТипуПретензии();
    
	
КонецПроцедуры

&НаСервере
Процедура Док_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	Если Объект.ПричинаВозникновения = Справочники.ПричиныВозникновенияПретензий.НайтиПоНаименованию("Качество") Тогда
		Элементы.ПредоставлениеФотоВидео.Доступность = Истина;
		Если Объект.ПредоставлениеФотоВидео = "Планируемая дата получения" Тогда
			Элементы.ДатаПредоставления.Видимость = Истина;
		Иначе
			Элементы.ДатаПредоставления.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ПредоставлениеФотоВидео.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗначенияСпискаВыбора()
	Элементы.ПредоставлениеФотоВидео.РежимВыбораИзСписка = Истина;
	Элементы.ПредоставлениеФотоВидео.СписокВыбора.Добавить("Приложены");
	Элементы.ПредоставлениеФотоВидео.СписокВыбора.Добавить("Клиент не может предоставить");
	Элементы.ПредоставлениеФотоВидео.СписокВыбора.Добавить("В фото нет необходимости");
	Элементы.ПредоставлениеФотоВидео.СписокВыбора.Добавить("Планируемая дата получения");
КонецПроцедуры


&НаКлиенте
Процедура Спр_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи) 
	
	Если Не Объект.ЭтоПретензияПоставщику Тогда	      
		Если Строка(Объект.ПричинаВозникновения) = "Качество" И Объект.ПредоставлениеФотоВидео = "" Тогда
			СообщитьПользователю("Объект.ПредоставлениеФотоВидео", "Заполните поле Предоставление фото/видео!");
			Отказ = Истина;
		КонецЕсли;
		
		Если Объект.ПредоставлениеФотоВидео = "Планируемая дата получения" И Объект.ДатаПредоставления = '00010101' Тогда
			СообщитьПользователю("Объект.ДатаПредоставления", "Заполните дату предоставления фото/видео!");
			Отказ = Истина;
		КонецЕсли;
				
		Если Объект.ЕстьПисьменнаяПретензия И Не ЗначениеЗаполнено(Объект.ДатаПисьменнойПретензии) Тогда
			СообщитьПользователю("Объект.ДатаПисьменнойПретензии","Дата письменной претензии не заполнена!");
			Отказ = Истина;
		КонецЕсли;
		Если  Не ЗначениеЗаполнено(Объект.МестонахождениеТовара) Тогда
			СообщитьПользователю("Объект.МестонахождениеТовара","Местонахождение товара не заполнено!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ТабличнаяЧастьТоварыНеЗаполнена() Тогда
			СообщитьПользователю("Объект.Товары","Табличная часть 'Товары' не заполнена!");
			Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы_Справочники

&НаКлиенте
Процедура Док_ЗаполнитьПоОснованиюПосле(Команда)
	
	Если Элементы.Товары1.КоманднаяПанель.ТолькоПросмотр = Истина Тогда 
		Предупреждение("Невозможно редакртировать данные");
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОткрытьПараметрыЗавершение",ЭтотОбъект);   	
		Если ЗначениеЗаполнено(Объект.ОснованиеЧекККМ) Тогда
			ПараметрыФормы = Новый Структура("Основание", Объект.ОснованиеЧекККМ);
		Иначе
			ПараметрыФормы = Новый Структура("Основание", Объект.Основание);
		КонецЕсли;
		ОткрытьФорму("Справочник.Претензии.Форма.Спр_ФормаТовары", ПараметрыФормы,ЭтаФорма,,,,Оповещение);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьПараметрыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	ОткрытьПараметрыЗавершениеСервер(Результат);
КонецПроцедуры 

&НаСервере 
Процедура ОткрытьПараметрыЗавершениеСервер(Результат) Экспорт 
	Если ТипЗнч(Результат) = Тип("ДанныеФормыКоллекция") тогда 
		 Объект.Товары.Загрузить(Результат.Выгрузить());
		 ПересчитатьСуммуПретензии();
	конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура Док_ОчиститьПосле(Команда)  
	
    Если Элементы.Товары1.КоманднаяПанель.ТолькоПросмотр = Истина Тогда 
		Предупреждение("Невозможно редакртировать данные");
	Иначе
		Объект.Товары.Очистить();
		ПересчитатьСуммуПретензии();		
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура Спр_КорректировкаСуммыПретензииВручнуюПриИзмененииПосле(Элемент)
	Элементы.СуммаПретензии.ТолькоПросмотр = Не Объект.КорректировкаСуммыПретензииВручную;
КонецПроцедуры

&НаКлиенте
Процедура Спр_ЕстьПисьменнаяПретензияПриИзмененииПосле(Элемент)
	Элементы.ДатаПисьменнойПретензии.ТолькоПросмотр = Не Объект.ЕстьПисьменнаяПретензия;
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователю(Поле,Текст)
	Сообщение = Новый СообщениеПользователю;
    Сообщение.Поле  = Поле;
    Сообщение.Текст = Текст;
    Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Функция Спр_СоздатьБППослеНаСервере()
	
	ПустаяСтрокаОтвета = "";
	ПретензияПоКачеству = Объект.ПричинаВозникновения = Справочники.ПричиныВозникновенияПретензий.НайтиПоНаименованию("Качество");
	
	Если НЕ (ЗначениеЗаполнено(Объект.Основание) ИЛИ ЗначениеЗаполнено(Объект.ОснованиеЧекККМ)) Тогда
		Сообщить("Претензия создана не на основании документа, создание БП невозможно!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;

	Если НЕ (ЗначениеЗаполнено(Объект.ПричинаВозникновения) И ЗначениеЗаполнено(Объект.Партнер) И Объект.СуммаПретензии > 0) Тогда
		Сообщить("Не заполнено одно из следующих полей - Причина возникновения, Партнер или Сумма претензии, создание БП невозможно!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
	Если ПретензияПоКачеству Тогда
		Если Объект.ПредоставлениеФотоВидео = "" Тогда
			Сообщить("Не заполнено Предоставление фото/видео!");
			Возврат ПустаяСтрокаОтвета;
		КонецЕсли;
		
		Если Объект.ПредоставлениеФотоВидео = "Планируемая дата получения" И Объект.ДатаПредоставления = '00010101' Тогда
			Сообщить("Не заполнена дата предоставления фото/видео!");
			Возврат ПустаяСтрокаОтвета;
		КонецЕсли;
	КонецЕсли;

	КодЭлементаПроцесса = Строка(Объект.Ссылка.УникальныйИдентификатор());

	АвторЗаписи = АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя();

	Если Не ЗначениеЗаполнено(АвторЗаписи) Тогда
		Сообщить("Текущий пользователь не найден в базе данных битрикса!");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	 
	СформироватьАктНесоответствия();
	ПрисоединенныеФайлыСписок = ПолучитьПрисоединенныеФайлы(Объект.Ссылка).ВыгрузитьКолонку("Ссылка");
	ЕстьПрисоединенныеФайлы = ПрисоединенныеФайлыСписок.Количество()> 0 ;
		
	//--ОтправкаДанныхЧерезRestApiБитрикса не используется
	//НомерФайла = 0;
	//Для каждого СтрокаФайл Из ПрисоединенныеФайлыСписок Цикл
	//	ИдФайла = ОтправкаДанныхЧерезRestApiБитрикса.ЗагрузитьФайлНаСервере("280481",СтрокаФайл.Ссылка,АвторЗаписи,КодЭлементаПроцесса);
	//	Если ЗначениеЗаполнено(ИдФайла) Тогда
	//		НомерФайла = НомерФайла + 1;
	//		Ид = СтрЗаменить(Строка(ИдФайла.result.ID),Символы.НПП,"");;
	//		МассивИдФайлов.Вставить("n"+Строка(НомерФайла),"n"+Ид);
	//		НомерФайла = НомерФайла + 1;
	//	КонецЕсли;
	//КонецЦикла;
	//--
	МассивОбъектовДляИдентификации = Новый Массив;
	МассивОбъектовДляИдентификации.Добавить(Подразделение);
	
	ТаблицаИдентификаторовБ24 = Справочники.Альтерра_НастройкиОбменаБитрикс.ПолучитьТаблицуИдентификаторов(МассивОбъектовДляИдентификации, "Претензии_клиентов", ЕстьПрисоединенныеФайлы);
	
	ОтборПоиска = Новый Структура;
	ОтборПоиска.Вставить("Объект");
	
	СтруктураД  = Новый Структура();
	
	СтруктураД.Вставить("NAME", Объект.Наименование);
	
	ОтборПоиска.Объект = Подразделение;
	СтрокиПодразделение = ТаблицаИдентификаторовБ24.НайтиСтроки(ОтборПоиска);
	Если СтрокиПодразделение.Количество()> 0 Тогда
		СтруктураД.Вставить("PROPERTY_1022", СтрокиПодразделение[0].Идентификатор);
	Иначе
		Сообщить("Для обязательного поля в значении " + Строка(Подразделение) + " не задан идентификатор Битрикс");
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;     
	
    Основание = ?(ЗначениеЗаполнено(Объект.ОснованиеЧекККМ), Объект.ОснованиеЧекККМ, Объект.Основание);	
	СтруктураД.Вставить("PROPERTY_1023", ?(Объект.ПричинаВозникновения = Справочники.ПричиныВозникновенияПретензий.НайтиПоНаименованию("Качество"), "1366", "1367"));
	СтруктураД.Вставить("PROPERTY_1017", Строка(Объект.Партнер));
	СтруктураД.Вставить("PROPERTY_1018", Строка(Основание.Ссылка));
	СтруктураД.Вставить("PROPERTY_1019", Строка(Основание.Дата));
	СтруктураД.Вставить("PROPERTY_1021", Объект.СуммаПретензии);
	СтруктураД.Вставить("PROPERTY_1051", Строка(Объект.МестонахождениеТовара));
	СтруктураД.Вставить("PROPERTY_1024", ?(Объект.ЕстьПисьменнаяПретензия, "1368", "1369"));
	СтруктураД.Вставить("PROPERTY_1035", Строка(Объект.ДатаПисьменнойПретензии));
	СтруктураД.Вставить("PROPERTY_1081", "1406");
	СтруктураД.Вставить("PROPERTY_1255", Строка(Объект.Код));
	
	Если ПретензияПоКачеству Тогда
		ТекстСтроки = Объект.ПредоставлениеФотоВидео;
		PROPERTY_3533 = ?(ТекстСтроки = "Планируемая дата получения", ТекстСтроки + ": " + Строка(Формат(Объект.ДатаПредоставления, "ДФ=dd.MM.yyyy")), ТекстСтроки); 
		СтруктураД.Вставить("PROPERTY_3533", PROPERTY_3533);
	КонецЕсли;
	
	Если ЕстьПрисоединенныеФайлы Тогда
		ОтборПоиска.Объект = "Ид папки с файлами";
		Строки = ТаблицаИдентификаторовБ24.НайтиСтроки(ОтборПоиска);
		Если Строки.Количество()> 0 Тогда
			Если Строки[0].Идентификатор = "" Тогда
				Сообщить("Не задан Ид папки с файлами");
				Возврат ПустаяСтрокаОтвета;
			Иначе
				МассивИДФайлов = АльтерраВзаимодействиеСБитрикс24.ЗагрузитьФайлыВБитрикс(Строки[0].Идентификатор, ПрисоединенныеФайлыСписок, АвторЗаписи, КодЭлементаПроцесса);
				СтруктураД.Вставить("PROPERTY_1127", МассивИДФайлов);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	СтруктураД.Вставить("CREATED_BY", АвторЗаписи);
	 
	Описание = ПолучитьОписаниеПретенизии(Основание);
	
	СтруктураД.Вставить("DETAIL_TEXT",Описание);
		
	СтруктураОтвета = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка("lists_socnet", "83", КодЭлементаПроцесса,СтруктураД);
	
	Если СтруктураОтвета.Свойство("НазваниеОшибки") Тогда
		Сообщить("Ошибка отправки в Битрикс: "+ СтруктураОтвета.ОписаниеОшибки + " (код ошибки = " + СтруктураОтвета.КодСостояния + ")");
	КонецЕсли;
	Если СтруктураОтвета.Свойство("Результат") или СтруктураОтвета.Свойство("result") Тогда
		Возврат СтруктураОтвета.result;
	Иначе
		Возврат ПустаяСтрокаОтвета;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Спр_СоздатьБППосле(Команда)
	Если Объект.ЭтоПретензияПоставщику Тогда
		Сообщить("Для Претензии Поставщику пока не предусмотрено создание БП!");
		Возврат; 
	КонецЕсли;
	КодЭлементаСписка = Спр_СоздатьБППослеНаСервере();
	Если Не ПустаяСтрока(КодЭлементаСписка) Тогда
		Объект.ИДБизнесПроцесса = КодЭлементаСписка;
		Сообщить("БП создан!");
		ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
		
		ЭтаФорма.элементы.ФормаСоздатьБП.Доступность=Ложь;
	Иначе
		Сообщить("БП не создан!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Спр_ОчиститьИДБППосле(Команда)
	Объект.ИДБизнесПроцесса = "";
КонецПроцедуры

&НаКлиенте
Процедура Док_ДобавитьНоменклатуруПосле(Команда)             
	Элементы.Товары1.ДобавитьСтроку();
КонецПроцедуры

&НаСервере
Процедура СформироватьАктНесоответствия()
	
	Если ЗначениеЗаполнено(Объект.ОснованиеЧекККМ) Тогда
		Основание =  Объект.ОснованиеЧекККМ;
	ИначеЕсли ЗначениеЗаполнено(Объект.Основание) Тогда
		Основание = Объект.Основание;
	Иначе
		Отказ = Истина;
	КонецЕсли; 
	
	Если Объект.ПричинаВозникновения = Справочники.ПричиныВозникновенияПретензий.НайтиПоНаименованию("Количество") Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.АвтоМасштаб = Истина;
		Макет = ПолучитьМакетНаСервере("АктНесоответствияТовараПоКоличеству");
		
		ОбрезатьКод = СтрРазделить(Объект.Код, "-");
		НомерАкта = Формат(Число(ОбрезатьКод[1]), "ЧГ=");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.НомерАкта = НомерАкта;
		ОбластьЗаголовок.Параметры.Дата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
		ОбластьРеквизиты.Параметры.Поставщик = Основание.Организация;
		ОбластьРеквизиты.Параметры.Покупатель = Объект.Партнер.Наименование;
		ТабДок.Вывести(ОбластьРеквизиты);
		
		ОбластьОснование = Макет.ПолучитьОбласть("Основание");
		ОбластьОснование.Параметры.ДокОснование = Основание;
		ОбластьОснование.Параметры.ДокОснованиеСумма = Основание.СуммаДокумента;
		ТабДок.Вывести(ОбластьОснование);
		
		Если ЗаданиеНаПеревозкуРейс <> Неопределено Тогда
			ОбластьРейс = Макет.ПолучитьОбласть("Рейс");
			ОбластьРейс.Параметры.Рейс = ЗаданиеНаПеревозкуРейс;
			ТабДок.Вывести(ОбластьРейс);
		КонецЕсли;
		
		ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
        ТабДок.Вывести(ОбластьШапкаТЧ);
		
		ОбластьТЧ = Макет.ПолучитьОбласть("ТЧ");
		Стр = 0;
		Для каждого Строка Из Объект.Товары Цикл
			Стр = Стр + 1; 
			ОбластьТЧ.Параметры.Стр = Стр;
			ОбластьТЧ.Параметры.Наименование = Строка.Номенклатура;
			ОбластьТЧ.Параметры.Код = Строка.Номенклатура.Код;
			ОбластьТЧ.Параметры.ЕдИзм = Строка.Номенклатура.ЕдиницаИзмерения;
			СтрокаВОсновании = Основание.Товары.Найти(Строка.Номенклатура);
			Если Строка.Количество > 0 Тогда
				ОбластьТЧ.Параметры.Отклонение = Строка("+" + Строка.Количество);
			Иначе
				ОбластьТЧ.Параметры.Отклонение = Строка.Количество;
			КонецЕсли;
						
			Если СтрокаВОсновании <> Неопределено Тогда
				ОбластьТЧ.Параметры.КоличествоДок = СтрокаВОсновании.Количество;
				ОбластьТЧ.Параметры.КоличествоФакт = Формат(СтрокаВОсновании.Количество + Строка.Количество, "ЧН=0");
			Иначе
				ОбластьТЧ.Параметры.КоличествоДок = "0";
				ОбластьТЧ.Параметры.КоличествоФакт = Формат(Строка.Количество, "ЧН=0");
			КонецЕсли; 
			 
			ТабДок.Вывести(ОбластьТЧ);
		КонецЦикла;
		
		//ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
		//ОбластьКомментарий.Параметры.Комментарий = Объект.Комментарий;
		//ТабДок.Вывести(ОбластьКомментарий);
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
        ТабДок.Вывести(ОбластьПодвал);
		
		ВременныйФайл = ПолучитьИмяВременногоФайла(".pdf");
		ТабДок.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.PDF);
		ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыФайла.Автор = ПараметрыСеанса.ТекущийПользователь.Наименование;
		ПараметрыФайла.ВладелецФайлов = Объект.Ссылка;
		ИмяФайла = Строка("Акт о несоответствии №" + НомерАкта);
		ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
		ПараметрыФайла.РасширениеБезТочки = "pdf";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПретензииПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПретензииПрисоединенныеФайлы КАК ПретензииПрисоединенныеФайлы
		|ГДЕ
		|	ПретензииПрисоединенныеФайлы.Наименование = &Наименование
		|	И ПретензииПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|   И Не ПретензииПрисоединенныеФайлы.Ссылка.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Наименование", ИмяФайла);
		Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтарыйФайл = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СтарыйФайл.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище);
		УдалитьФайлы(ВременныйФайл);
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура Док_ПричинаВозникновенияОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)  
	
	ПричинаВозникновения = ВыбранноеЗначение;
	
	Если Строка(ВыбранноеЗначение) = "Качество" Тогда
		Элементы.ПредоставлениеФотоВидео.Доступность = Истина;
	Иначе
		Элементы.ПредоставлениеФотоВидео.Доступность = Ложь;
		Элементы.ДатаПредоставления.Видимость = Ложь;
		Объект.ПредоставлениеФотоВидео =  "";
		Объект.ДатаПредоставления = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПредоставлениеФотоВидеоОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда
		Объект.ПредоставлениеФотоВидео = ВыбранноеЗначение;
		
		Если ВыбранноеЗначение = "Планируемая дата получения" Тогда
			Элементы.ДатаПредоставления.Видимость = Истина;
		Иначе
			Элементы.ДатаПредоставления.Видимость = Ложь;
			Объект.ДатаПредоставления = '00010101';
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область Вспомогательные

Функция ПолучитьПрисоединенныеФайлы(ВладелецФайлов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПретензииПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ПретензииПрисоединенныеФайлы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПретензииПрисоединенныеФайлы КАК ПретензииПрисоединенныеФайлы
		|ГДЕ
		|	ПретензииПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ ПретензииПрисоединенныеФайлы.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайлов);
	//Альтерра+ Проходим по упорядоченному запросу в поиске дублей, как только нашли дубль, делаем возврат, сообщая об ошибке
	Результат =  Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ИмяДляСравнения = ""; 
	Пока Выборка.Следующий() Цикл 
		Если ИмяДляСравнения = Выборка.Наименование Тогда 
			Сообщить("В присоединенных файлах есть файлы с одинаковым названием. Переименуйте дубли или удалите один из них");
			Возврат неопределено;
		КонецЕсли;
		ИмяДляСравнения = Выборка.Наименование
	КонецЦикла;
	//-
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПолучитьОписаниеПретенизии(Основание)
	 СтрокаВозврата = "Товары:" + Символы.ПС;
	 
	 Для каждого Строка из Объект.Товары Цикл
		 СтрокаВозврата = СтрокаВозврата + Строка.Номенклатура + " - " + Строка.Количество + " - " + Строка.Оборот + Символы.ПС;
	 КонецЦикла;
	 
	 СтрокаВозврата = СтрокаВозврата + "Описание претензии: " + Объект.ОписаниеПретензии+Символы.ПС;

	 СтрокаВозврата = СтрокаВозврата + ПолучитьРейс(Основание,Ложь)+Символы.ПС;
	 
	 СтрокаВозврата = СтрокаВозврата + "Комментарий: " + Объект.Комментарий;
	 Возврат СтрокаВозврата;
КонецФункции

Функция ПолучитьДокументПродажи(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		ДокументПродажи = Основание.ЧекККМ;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		ДокументПродажи = Основание.ДокументРеализации;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ДокументПродажи = Основание.ДокументОснование;
	Иначе
		ДокументПродажи = Основание;
	КонецЕсли;
	
	Возврат ДокументПродажи;
	
КонецФункции

Функция ПолучитьРейс(ДокументПродажи,ТолькоРейс) 	
	
	ВозвращаемоеЗначение = "";
	
	ДокументРейс = "";	
	ДокументРейс = ПолучитьРейсПоДокументуПродажи(ДокументПродажи);
	
	Если ЗначениеЗаполнено(ДокументРейс) Тогда
		Если ТолькоРейс Тогда
			ВозвращаемоеЗначение = ДокументРейс;
		Иначе
			ВозвращаемоеЗначение = "По документу продажи есть рейс: " + ДокументРейс;
		КонецЕсли;
	Иначе
		Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если ЗначениеЗаполнено(ДокументПродажи.ЗаказКлиента) Тогда
				ДокументРейс = ПолучитьРейсПоДокументуПродажи(ДокументПродажи.ЗаказКлиента);
				Если ЗначениеЗаполнено(ДокументРейс) Тогда
					Если ТолькоРейс Тогда
						ВозвращаемоеЗначение = ДокументРейс;
					Иначе
						ВозвращаемоеЗначение = "По документу продажи есть рейс: " + ДокументРейс;
					КонецЕсли;
				Иначе
					ВозвращаемоеЗначение = "По документу продажи нет рейса.";
				КонецЕсли;
			Иначе
				ВозвращаемоеЗначение = "По документу продажи нет рейса.";
			КонецЕсли;
		Иначе
			ВозвращаемоеЗначение = "По документу продажи нет рейса.";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
    	
КонецФункции

Функция ПолучитьРейсПоДокументуПродажи(ДокументПродажи) 	
	ДокументРейс = "";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыКДоставке.Рейс КАК Рейс
		|ИЗ
		|	РегистрНакопления.ЗаказыКДоставке КАК ЗаказыКДоставке
		|ГДЕ
		|	ЗаказыКДоставке.ДокументПродажи = &ДокументПродажи";
	
	Запрос.УстановитьПараметр("ДокументПродажи", ДокументПродажи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДокументРейс = ВыборкаДетальныеЗаписи.Рейс;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДокументРейс;
    	
КонецФункции

Функция ПолучитьПодразделениеОснование(ДокументОснование)
	
	//ПодразделениеДокумента=Справочники.СтруктураПредприятия.ПустаяСсылка();
	если не значениезаполнено(ДокументОснование) тогда
		ПодразделениеДокумента=Пользователи.ТекущийПользователь().Подразделение;
	иначе
		Если Не ДокументОснование.ПолучитьОбъект().Метаданные().Реквизиты.Найти("Подразделение") = Неопределено Тогда
			ОснованиеДокументОбъект = ДокументОснование.ПолучитьОбъект();
		ИначеЕсли Не ДокументОснование.ПолучитьОбъект().Метаданные().Реквизиты.Найти("ЧекККМ") = Неопределено Тогда
			ОснованиеДокументОбъект = ДокументОснование.ЧекККМ.ПолучитьОбъект();	
		КонецЕсли;
		
		ПодразделениеДокумента = ОснованиеДокументОбъект.Подразделение;
	конецесли;
	Возврат ПодразделениеДокумента;
	
КонецФункции

Функция ТабличнаяЧастьТоварыНеЗаполнена()
	
	Результат = 0;
	
	ОснованиеПретензии = ?(ЗначениеЗаполнено(Объект.ОснованиеЧекККМ), Объект.ОснованиеЧекККМ,?(ЗначениеЗаполнено(Объект.Основание),Объект.Основание,Неопределено));
	Если Не ОснованиеПретензии = Неопределено Тогда
		Если Не ОснованиеПретензии.ПолучитьОбъект().Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
			Если Объект.Товары.Количество()=0 Тогда
			Результат = 1;	 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ?(Результат = 1, Истина, Ложь)
	
КонецФункции

Функция ДоступныПолныеПрава()
	Возврат АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава");
КонецФункции

Функция ПолучитьМакетНаСервере(Макет)
	МакетОбъект = РеквизитФормыВЗначение("Объект");
	Макет = МакетОбъект.ПолучитьМакет(Макет);
	Возврат Макет;
КонецФункции

#КонецОбласти  

#Область ПересчетСуммы
&НаКлиенте
Процедура Док_Товары1КоличествоПриИзмененииПосле(Элемент)
	ПересчитатьСуммуИКоличествоВСтроке(Элементы.Товары1.ТекущиеДанные);
	ПересчитатьСуммуПретензии();
КонецПроцедуры


&НаКлиенте
Процедура Док_Товары1КоличествоБракПриИзмененииПосле(Элемент)
	ПересчитатьСуммуИКоличествоВСтроке(Элементы.Товары1.ТекущиеДанные);
	ПересчитатьСуммуПретензии();
КонецПроцедуры 

&НаКлиенте
Процедура Док_Товары1ПриИзмененииПосле(Элемент)
	ПересчитатьСуммуПретензии();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуИКоличествоВСтроке(СтрокаТабличнойЧасти)  	
	
	СтрокаТабличнойЧасти.Оборот = ?((СтрокаТабличнойЧасти.Количество > 0),
	(СтрокаТабличнойЧасти.Количество + СтрокаТабличнойЧасти.КоличествоБрак) * СтрокаТабличнойЧасти.Цена,
	(-СтрокаТабличнойЧасти.Количество + СтрокаТабличнойЧасти.КоличествоБрак) * СтрокаТабличнойЧасти.Цена); 
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПретензии()
	Если Не Объект.КорректировкаСуммыПретензииВручную Тогда
		Объект.СуммаПретензии = 0;
		Объект.СуммаПретензии = Объект.Товары.Итог("Оборот");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ИзмененияПоТипуПретензии   

&НаСервере
&После("ПретензияПоставщикуПриИзмененииНаСервере")
Процедура Док_ПретензияПоставщикуПриИзмененииНаСервере()
	ИзменитьФормуПоТипуПретензии();
КонецПроцедуры

&НаКлиенте
Процедура Док_РезультатПоПретензииПриИзмененииПосле(Элемент)
//Доработки для претензий поставщику
ОбнулитьСуммуУдовлетворения();	
КонецПроцедуры 

&НаКлиенте
Процедура Док_ИсточникПретензииПриИзмененииПосле(Элемент) 

Если ЭтоПретензияОтКлиента() Тогда  
	
	ОчиститьКоличествоВТабличнойчасти();  
	
	Для Каждого Строка Из Объект.Товары Цикл
		ПересчитатьСуммуИКоличествоВСтроке(Строка);  
	КонецЦикла;
	ПересчитатьСуммуПретензии();

КонецЕсли;

УстановитьДоступностьТоварыНедовоз();

КонецПроцедуры  


&НаСервере
Функция ЭтоПретензияОтКлиента()
	
	Если Объект.ИсточникПретензии = Перечисления.ИсточникПретензииПоставщику.ОтКлиента Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура ОчиститьКоличествоВТабличнойчасти()   
	
	ТабЗнач = Объект.Товары.Выгрузить();
	ТабЗнач.ЗаполнитьЗначения(0, "Количество");
	Объект.Товары.Загрузить(ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура ОбнулитьСуммуУдовлетворения() 
	Если Объект.РезультатПоПретензии = Перечисления.РезультатыРассмотренияПретензииПоставщику.УдовлетворенаЧастично 
		ИЛИ Объект.РезультатПоПретензии = Перечисления.РезультатыРассмотренияПретензииПоставщику.НеУдовлетворена Тогда  
		Объект.СуммаУдовлетворения = 0;	
	КонецЕсли;
КонецПроцедуры
	

&НаСервере
Процедура УстановитьДоступностьТоварыНедовоз()
	
	Если Объект.ИсточникПретензии = Перечисления.ИсточникПретензииПоставщику.ОтКлиента Тогда 
		Элементы.Товары1Количество.Доступность = Ложь;
	Иначе
		Элементы.Товары1Количество.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СтатусПретензииПоставщикуПриИзмененииПосле(Элемент) 
	СтатусПоставщикуПриИзмененииНаСервере()
КонецПроцедуры	

&НаСервере
Процедура СтатусПоставщикуПриИзмененииНаСервере()
	Если Объект.Ссылка.СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.Отправлена
		И Объект.СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.ВРаботе Тогда 
		Объект.Исполнитель = Справочники.Пользователи.ПустаяСсылка(); 
		Сообщить("Нужно изменить исполнителя!");
	КонецЕсли;
КонецПроцедуры

 &НаСервере
Процедура ИзменитьФормуПоТипуПретензии()
//Доработки для претензий поставщику    

	ЭтоПретензияПоставщику = Объект.ЭтоПретензияПоставщику;  
	
	//Установка видимости реквизитов Претензии Поставщику
	Элементы.ГруппаДаты.Видимость                      = ЭтоПретензияПоставщику;
	Элементы.СчетФактураПолученный.Видимость           = ЭтоПретензияПоставщику;
	Элементы.ИсточникПретензии.Видимость               = ЭтоПретензияПоставщику;
    Элементы.СчетФактураПолученный.Видимость           = ЭтоПретензияПоставщику; 
	Элементы.СтраницаВРаботе.Видимость                 = ЭтоПретензияПоставщику; 
	Элементы.СтатусПретензииПоставщику.Видимость       = ЭтоПретензияПоставщику;
    Элементы.ГруппРезПоПретензСуммУдовл.Видимость      = ЭтоПретензияПоставщику;
	Элементы.НомерИсходящегоПисьмаПоставщику.Видимость = ЭтоПретензияПоставщику;
	Элементы.НомерЗадачиВБитриксе.Видимость            = ЭтоПретензияПоставщику;                                                     
	Элементы.Контрагент.Видимость                      = ЭтоПретензияПоставщику;           
	
	Элементы.Товары1КоличествоБрак.Видимость           = ЭтоПретензияПоставщику;
	
	//Скрытие видимости реквизитов Претензии Клиента  
	Элементы.Наименование.Видимость                    = Не ЭтоПретензияПоставщику;
	Элементы.СтраницаПартнерыКонтактныеЛица.Видимость  = Не ЭтоПретензияПоставщику;
	Элементы.ОснованиеЧекККМ.Видимость                 = Не ЭтоПретензияПоставщику;
	Элементы.ЗаданиеНаПеревозкуРейс.Видимость          = Не ЭтоПретензияПоставщику;
	Элементы.Комментарий.Видимость                     = Не ЭтоПретензияПоставщику;
	Элементы.Статус.Видимость                          = Не ЭтоПретензияПоставщику;
	Элементы.ФИО.Видимость                             = Не ЭтоПретензияПоставщику;  
	Элементы.ПредоставлениеФотоВидео.Видимость         = Не ЭтоПретензияПоставщику;
	Элементы.ЕстьПисьменнаяПретензия.Видимость         = Не ЭтоПретензияПоставщику;
	Элементы.МестонахождениеТовара.Видимость           = Не ЭтоПретензияПоставщику;
    Элементы.ДатаПисьменнойПретензии.Видимость         = Не ЭтоПретензияПоставщику;    
	Элементы.ВестиРасчетыПоПретензии.Видимость         = Не ЭтоПретензияПоставщику; 
	Элементы.ИДБизнесПроцесса.Видимость                = Не ЭтоПретензияПоставщику; 
    Элементы.Партнер.Видимость                         = Не ЭтоПретензияПоставщику;      
	
	Если ЭтоПретензияПоставщику Тогда 
		Если Объект.ДатаОтветаПоставщика = '00010101' Тогда
			Объект.ДатаОтветаПоставщика = Объект.ДатаРегистрации + 864000;
			Исполнитель = Пользователи.ТекущийПользователь();
		КонецЕсли;
		Элементы.Товары1Количество.Заголовок = "Количество недовоз / излишек";  	
		УстановитьДоступностьТоварыНедовоз();		
		//Счет фактура  
		Если Объект.Основание <> Неопределено Тогда
			ПараметрыРегистрации = Документы.ПриобретениеТоваровУслуг.ПараметрыРегистрацииСчетовФактурПолученных(Объект.Основание);
			СчетаФактурыПолученныеНаОсновании = УчетНДСУП.СчетаФактурыПолученныеНаОсновании(ПараметрыРегистрации); 
			Если  СчетаФактурыПолученныеНаОсновании.СчетаФактуры.Количество() > 0 Тогда
				СчетФактураПолученный  = СчетаФактурыПолученныеНаОсновании.СчетаФактуры[0]; 
			КонецЕсли; 
		КонецЕсли;  	
	КонецЕсли;  
	
   БлокировкаФормыДляРедактирования();
КонецПроцедуры 


&НаКлиенте
Процедура Док_ПричинаВозникновенияНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)   
	
	Если Объект.ЭтоПретензияПоставщику Тогда
		СтандартнаяОбработка = Истина
	Иначе   
		
	МассивЗначений = ПолучитьМассивЗначений(); 
	ДанныеВыбора = МассивЗначений;	
	СтандартнаяОбработка = Ложь; 
	
	Форма = ОткрытьФорму("Справочник.ПричиныВозникновенияПретензий.ФормаВыбора",, Элемент);
	
		ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
		ОтборВладелец.Использование = Истина; 
		ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка"); 
		ОтборВладелец.ПравоеЗначение = МассивЗначений;    
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция  ПолучитьМассивЗначений()
	
    МассивЗначений = Новый Массив();
			
	МассивЗначений.Добавить(Справочники.ПричиныВозникновенияПретензий.НайтиПоНаименованию("Количество")); 
	МассивЗначений.Добавить(Справочники.ПричиныВозникновенияПретензий.НайтиПоНаименованию("Качество"));
	
	Возврат МассивЗначений;
КонецФункции

Процедура БлокировкаФормыДляРедактирования() 
		
	Элементы.ГруппаБП.ТолькоПросмотр = Ложь;
	Элементы.ГруппаСтраницы.ТолькоПросмотр = Ложь;
    Элементы.Статус.ТолькоПросмотр = Ложь;
    Элементы.СтатусПретензииПоставщику.ТолькоПросмотр = Ложь;
	Элементы.Товары1.КоманднаяПанель.ТолькоПросмотр = Ложь;
	
	Если Объект.ЭтоПретензияПоставщику Тогда	
		Если (Объект.СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.НеВыставляем 
			ИЛИ Объект.СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.Завершена) Тогда
			
			Элементы.ГруппаБП.ТолькоПросмотр = Истина;
			Элементы.ГруппаСтраницы.ТолькоПросмотр = Истина;
			Элементы.Статус.ТолькоПросмотр = Истина;
            Элементы.Товары1.КоманднаяПанель.ТолькоПросмотр = Истина; 
			
			Если НЕ(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("РедактированиеЗавершенныхПретензийПоставщику")) Тогда  
			     Элементы.СтатусПретензииПоставщику.ТолькоПросмотр = Истина;
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли; 
	

КонецПроцедуры 

&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	БлокировкаФормыДляРедактирования();
	ОтправкаСообщенияПостановкаЗадачиПоСумме();
КонецПроцедуры

&НаКлиенте
Процедура Док_Товары1НоменклатураПриИзмененииПосле(Элемент) 
	ТекущаяСтрока = Элементы.Товары1.ТекущиеДанные;
	ТекущаяСтрока.Цена = ПолучитьЦенуПоСебестоимости(ТекущаяСтрока.Номенклатура);
	
	ПересчитатьСуммуИКоличествоВСтроке(Элементы.Товары1.ТекущиеДанные);
	ПересчитатьСуммуПретензии();
КонецПроцедуры 

&НаСервере 
Функция ПолучитьЦенуПоСебестоимости(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст =

	"ВЫБРАТЬ
	|	(СебестоимостьТоваровОстатки.СтоимостьОстаток + СебестоимостьТоваровОстатки.ДопРасходыОстаток) / СебестоимостьТоваровОстатки.КоличествоОстаток КАК ЦенаТовара
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки КАК СебестоимостьТоваровОстатки
	|ГДЕ
	|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура";
 
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЦенаТовара;
	Иначе 
		Возврат 0;
	КонецЕсли;	
КонецФункции


&НаКлиенте
Процедура Док_Товары1ЦенаПриИзмененииПосле(Элемент)
	ПересчитатьСуммуИКоличествоВСтроке(Элементы.Товары1.ТекущиеДанные);
	ПересчитатьСуммуПретензии();
КонецПроцедуры


&НаКлиенте
Процедура Док_ПричинаВозникновенияПриИзмененииПосле(Элемент)
	Если Строка(Объект.ПричинаВозникновения) = "Качество" Тогда
		Элементы.ПредоставлениеФотоВидео.Доступность = Истина;
		Если Объект.ПредоставлениеФотоВидео = "Планируемая дата получения" Тогда
			Элементы.ДатаПредоставления.Видимость = Истина;
		Иначе
			Элементы.ДатаПредоставления.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ПредоставлениеФотоВидео.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#Область ОтправкаСообщенияПостановкаЗадачиПоСумме
&НаСервере
Процедура ОтправкаСообщенияПостановкаЗадачиПоСумме()
	Если Объект.ЭтоПретензияПоставщику И Объект.СтатусПретензииПоставщику = Перечисления.СтатусыПретензийПоставщику.Отправлена Тогда
		СтруктураПараметров = ДопМодуль.ПолучитьНастройкиХранилища("НастройкиСуммИЧатаДляПретензий","НастройкиХранилища.epf"); 
		Если СтруктураПараметров = Неопределено Тогда
			АльтерраОбщегоНазначения.СообщитьПользователю(, "Не заданы настройки отправки уведомлений/постановки задачи, обратитесь в тех. поддержку");
			Возврат;
		Иначе
			СуммаНаОповещение = СтруктураПараметров.СуммаНаОповещение;
			СуммаНаЗадачу = СтруктураПараметров.СуммаНаЗадачу;
			КодЧата = СтруктураПараметров.КодЧата;
			ДолжностьИсполнитель = СтруктураПараметров.ДолжностьИсполнитель;
			ДолжностьНаблюдатель = СтруктураПараметров.ДолжностьНаблюдатель;
			Руководители = ПолучитьРуководителей(ДолжностьИсполнитель, ДолжностьНаблюдатель);
			Если НЕ ЗначениеЗаполнено(Руководители) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СобытиеСообщение = Справочники.СобытияОбъектовАльтерра.НайтиПоНаименованию("Претензия отправка сообщения");
		СобытиеЗадача = Справочники.СобытияОбъектовАльтерра.НайтиПоНаименованию("Претензия задача на руководителя ОК");
		
		Если Объект.СуммаПретензии >= СуммаНаЗадачу И ЗначениеЗаполнено(СобытиеЗадача) И НЕ РегистрыСведений.СобытияОбъектовАльтерра.БылоСобытие(Объект.Ссылка, СобытиеЗадача) Тогда
			СтруктураПараметров = ПолучитьСтруктуруПараметровЗадачи(Руководители);
			СтруктураПараметров.Заголовок = "Претензия поставщику " + Объект.Контрагент + " на сумму " + Объект.СуммаПретензии + ", Исх. " + Объект.НомерИсходящегоПисьмаПоставщику;
			
			СтруктураПараметров.Описание = Объект.ОписаниеПретензии + Символы.ПС
										+ ПолучитьТоварыСтрокой() + Символы.ПС
										+ "Ссылка на претензию в 1С: " + ПолучитьНавигационнуюСсылку(Объект.Ссылка);
			
			АльтерраВзаимодействиеСБитрикс24.СоздатьЗадачу(СтруктураПараметров);
			РегистрыСведений.СобытияОбъектовАльтерра.ЗаписатьСобытие(Объект.Ссылка, СобытиеЗадача);
		КонецЕсли;
		
		Если Объект.СуммаПретензии >= СуммаНаОповещение И ЗначениеЗаполнено(СобытиеСообщение) И НЕ РегистрыСведений.СобытияОбъектовАльтерра.БылоСобытие(Объект.Ссылка, СобытиеСообщение) Тогда
			
			ТекстСообщения = "[b]Претензия поставщику " + Объект.Контрагент + " на сумму " + Объект.СуммаПретензии + ", Исх. " + Объект.НомерИсходящегоПисьмаПоставщику + "[/b]" + Символы.ПС
							+ ПолучитьТоварыСтрокой() + Символы.ПС
							+ ПолучитьНавигационнуюСсылку(Объект.Ссылка);
							
			АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитриксПоИДЧата(ТекстСообщения, КодЧата);
			РегистрыСведений.СобытияОбъектовАльтерра.ЗаписатьСобытие(Объект.Ссылка, СобытиеСообщение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыСтрокой()
	ТоварыСтрока = "Товары: ";
	Шаблон = "%1) %2, кол-во %3 ед., брак %4 ед., цена %5 руб., оборот %6 руб.";
	Для каждого стр из Объект.Товары Цикл
		ТоварыСтрока = ТоварыСтрока + Символы.ПС +
					СтрШаблон(Шаблон, стр.НомерСтроки, стр.Номенклатура, стр.Количество, стр.КоличествоБрак, стр.Цена, стр.Оборот);
				КонецЦикла;
	Возврат ТоварыСтрока;
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПараметровЗадачи(Руководители)
	СтруктураПараметров = Новый Структура("
		|Постановщик,
		|Ответственные,
	    |Наблюдатели,
		|Заголовок,
		|Описание,
		|КрайнийСрок,
		|ИДГруппы,
		|ИДРодительскойЗадачи");
	

	Ответственные = Новый Массив();
	Ответственные.Добавить(Руководители.Исполнитель); //Исполнитель задачи
	Ответственные.Добавить(Объект.Исполнитель); //Соисполнитель
	
	Наблюдатели = Новый Массив();
	Наблюдатели.Добавить(Руководители.Наблюдатель);
	
	СтруктураПараметров.Постановщик = Руководители.Исполнитель;
	СтруктураПараметров.Ответственные = Ответственные;
	СтруктураПараметров.Наблюдатели = Наблюдатели;
    Возврат СтруктураПараметров;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРуководителей(ДолжностьИсполнитель, ДолжностьНаблюдатель)
	Руководители = Новый Структура();
	СписокДолжностей = Новый Массив();
	СписокДолжностей.Добавить(ДолжностьИсполнитель);
	СписокДолжностей.Добавить(ДолжностьНаблюдатель);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Сотрудники.Ссылка КАК Ссылка,
	                      |	ВЫБОР
	                      |		КОГДА Сотрудники.Должность = &ДолжностьИсполнитель
	                      |			ТОГДА ""Исполнитель""
	                      |		ИНАЧЕ ""Наблюдатель""
	                      |	КОНЕЦ КАК Ключ
	                      |ИЗ
	                      |	Справочник.Сотрудники КАК Сотрудники
	                      |ГДЕ
	                      |	НЕ Сотрудники.Уволен
	                      |	И Сотрудники.Должность В(&СписокДолжностей)");
	
	Запрос.УстановитьПараметр("ДолжностьИсполнитель", ДолжностьИсполнитель);
	Запрос.УстановитьПараметр("СписокДолжностей", СписокДолжностей);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() <> 2 Тогда
		АльтерраОбщегоНазначения.СообщитьПользователю(, "Не найден " + Строка(ДолжностьИсполнитель) + " или " + Строка(ДолжностьНаблюдатель) + "!");
		Возврат Неопределено;
	КонецЕсли;
	
	Пока Результат.Следующий() Цикл
		Руководители.Вставить(Результат.Ключ, Результат.Ссылка);
	КонецЦикла;
	
	Возврат Руководители;
КонецФункции

#КонецОбласти
